package ru.seranpol;

import com.google.common.collect.Lists;

/**
 * Создать свой Java Gradle проект;
 * Добавить зависимость Guava (популярная библиотека от Google, содержащая набор утилитарных механизмов).
 * Воспользоваться утилитарным классом Lists:
 * Развернуть список элементов
 * Получить лист Character из строки
 * Разделить лист на группы по 2 элемента
 * Воспользоваться утилитарным классом Sets
 * Получить итоговый Set из двух коллекций
 * Получить итоговый Set из общих элементов двух коллекций
 * Получить итоговый Set из непересекающихся элементов двух коллекций
 */
public class Main {
    public static void main(String[] args) {
        Lists
    }
}